app/Controllers/Login.php

    public function auth_operator()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $data = $this->operatorModel->where('username_operator', $username)->first();
---
SELECT *
FROM `operator`
WHERE `username_operator` = 'agung'
 LIMIT 1