app/Controllers/Operator.php

SELECT *
FROM `ekskul`
---
    public function ekskul()
    {
        $data =[
            'title' => 'ekskul',
            'ekskul' => $this->ekskulModel->findAll()

INSERT INTO `ekskul` (`ekskul`, `gambar_ekskul`, `deskripsi_ekskul`) VALUES ('Tapak Suci', 'WhatsApp Image 2022-01-30 at 18.41.48 (1).jpeg', 'Ini Deskripsi')
---
    public function store_ekskul()
    {
        $data = [
           'ekskul' => $this->request->getPost('ekskul'),
           'gambar_ekskul' => $this->request->getFile('gambar')->getName(),
           'deskripsi_ekskul' => $this->request->getPost('text')
        ];

        if ($this->request->getFile('gambar')->isValid() && !$this->request->getFile('gambar')->hasMoved()) {
            $this->request->getFile('gambar')->move('uploads');
        }

        $this->ekskulModel->save($data);

SELECT *
FROM `dt_ekskul`
---
    public function dt_ekskul()
    {
        $data = [
            'title' => 'detail ekskul',
            'dt_ekskul' => $this->dtekskulModel->findAll()

SELECT *
FROM `ekskul`
SELECT *
FROM `kriteria`
---
    public function add_dt_ekskul()
    {
        $data =[
            'title' => 'tembah detail ekskul',
            'ekskul' => $this->ekskulModel->findAll(),
            'kriteria' => $this->kriteriaModel->findAll(),